---
title: ReferencePointArray
classe: Autodesk.Revit.DB.ReferencePointArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# ReferencePointArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `referencePointArray.IsEmpty` | Boolean |
| `ReferencePoint Item { get; set; }` | `referencePointArray.Item` | ReferencePoint |
| `Int32 Size { get; }` | `referencePointArray.Size` | Int32 |
| `Void Append(ReferencePoint)` | `referencePointArray.Append(item)` | Void |
| `Void Clear()` | `referencePointArray.Clear()` | Void |
| `ReferencePointArrayIterator ForwardIterator()` | `referencePointArray.ForwardIterator()` | ReferencePointArrayIterator |
| `IEnumerator GetEnumerator()` | `referencePointArray.GetEnumerator()` | IEnumerator |
| `Void Insert(ReferencePoint, Int32)` | `referencePointArray.Insert(item, index)` | Void |
| `ReferencePointArrayIterator ReverseIterator()` | `referencePointArray.ReverseIterator()` | ReferencePointArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```